---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetDocumentMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application)
source: html/62474c63-9650-c5e8-7a42-618a557faea2.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetDocumentMacroSecurityOptions Method

Gets the document macro security options.

## Syntax (C#)
```csharp
public static DocumentMacroOptions GetDocumentMacroSecurityOptions(
	Application application
)
```

## Parameters
- **application** (`Autodesk.Revit.ApplicationServices.Application`) - The application.

## Returns
Returns the document macro security options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null